Tekla Open API Reference for Tekla Structures 2025
IStringDataType Properties
The IStringDataType type exposes the following members.
Properties
Name | Description
Value
 The string value of the field.
Top
See Also
Reference
IStringDataType Interface
Tekla.Structures.Datatype Namespace